import { Props } from './IntroBlock';

import b1 from '../../assets/b1.jpg';
import b2 from '../../assets/b2.jpg';

import a1 from '../../assets/ad1.jpg';
import a2 from '../../assets/ad2.jpg';
import a3 from '../../assets/ad3.jpg';
import a4 from '../../assets/ad4.jpg';

export const bannerConfig = [b1, b2];

export const blockConfig: Props[] = [
  {
    src: a1,
    title: '初级会计师',
    content: [
      '初级会计实务、经济法基础',
      '2024年初级会计报名时间1月5日-1月26日，考试5月18日至22日举行，4月17日前公布备地准考证网上打印时间，6月21日前公布初级会计资格考试成绩。《初级会计实务》考试时长105分钟《经济法基础》考试时长75分钟，两个科目连续考试，时间不能混用。',
    ],
    linkage: 'junior-accountant/11',
  },
  {
    src: a2,
    title: '中级会计师',
    content: [
      '初级会计实务、经济法基础',
      '2024年初级会计报名时间1月5日-1月26日，考试5月18日至22日举行，4月17日前公布备地准考证网上打印时间，6月21日前公布初级会计资格考试成绩。《初级会计实务》考试时长105分钟《经济法基础》考试时长75分钟，两个科目连续考试，时间不能混用。',
    ],
    linkage: '',
  },
  {
    src: a3,
    title: '注册会计师',
    content: [
      '初级会计实务、经济法基础',
      '2024年初级会计报名时间1月5日-1月26日，考试5月18日至22日举行，4月17日前公布备地准考证网上打印时间，6月21日前公布初级会计资格考试成绩。《初级会计实务》考试时长105分钟《经济法基础》考试时长75分钟，两个科目连续考试，时间不能混用。',
    ],
    linkage: '',
  },
  {
    src: a4,
    title: '税务师',
    content: [
      '初级会计实务、经济法基础',
      '2024年初级会计报名时间1月5日-1月26日，考试5月18日至22日举行，4月17日前公布备地准考证网上打印时间，6月21日前公布初级会计资格考试成绩。《初级会计实务》考试时长105分钟《经济法基础》考试时长75分钟，两个科目连续考试，时间不能混用。',
    ],
    linkage: '',
  },
];
